### Analicemos este escenario paso a paso y cómo resolver cada una de los requerimientos que se plantean:

En una casa editorial se desea controlar la edición y la distribución de los libros. Para ello
se toman en cuenta las distintas presentaciones de los libros, las librerı́as a las que se envı́an,
entre otros datos.

**Persona**(<u>idPersona</u> INT, nombre VARCHAR(50))

**Género**(<u>codGen</u> INT, nombreGen VARCHAR(50), descripción TEXT)

**Libro**(<u>idLibro</u> INT, tı́tulo VARCHAR(100), idAutor INT)

idAutor FK References Persona(idPersona)

**LibroGénero**(<u>idLibro</u> INT, codGen INT)

idLibro FK References Libro(idLibro)

codGen FK References Género(codGen)

**Carátula**(<u>codCarátula</u> INT, idDiseñador INT, tipoDiseño VARCHAR(100))

idDiseñador FK References Persona(idPersona)

**EdiciónLibro**(<u>idLibro</u> INT, codCarátula INT, fechaPublicación DATETIME, precioVenta INT,
cantEjemplares INT)

idLibro FK References Libro(idLibro)

codCarátula FK References Carátula(codCarátula)

In [1]:
import sqlalchemy
sqlalchemy.create_engine("mysql://root:root@localhost:3306")
%load_ext sql
%sql mysql://root:root@localhost:3306

Creemos la base de datos y las tablas correspondientes:

In [2]:
%%sql
DROP DATABASE IF EXISTS PruebaFinal1erSemestre2023;

 * mysql://root:***@localhost:3306
7 rows affected.

[]

In [3]:
%%sql

CREATE DATABASE IF NOT EXISTS PruebaFinal1erSemestre2023;
USE PruebaFinal1erSemestre2023;

 * mysql://root:***@localhost:3306
1 rows affected.
0 rows affected.

[]

In [4]:
%%sql

CREATE TABLE Persona(
   idPersona INT PRIMARY KEY,
   nombre VARCHAR(50) NOT NULL
);

CREATE TABLE Genero(
   codGen INT PRIMARY KEY,
   nombreGen VARCHAR(50) NOT NULL UNIQUE,
   descripcion TEXT NOT NULL
);

CREATE TABLE Libro(
   idLibro INT PRIMARY KEY,
   titulo VARCHAR(100) NOT NULL,
   idAutor INT NOT NULL,
   FOREIGN KEY (idAutor) REFERENCES Persona(idPersona)
);

CREATE TABLE LibroGenero(
   idLibro INT NOT NULL,
   codGen INT NOT NULL,
   PRIMARY KEY (idLibro, codGen),
   FOREIGN KEY (idLibro) REFERENCES Libro(idLibro),
   FOREIGN KEY (codGen) REFERENCES Genero(codGen)
);

CREATE TABLE Caratula(
   codCaratula INT PRIMARY KEY,
   idDiseñador INT NOT NULL,
   tipoDiseño VARCHAR(100) NOT NULL,
   FOREIGN KEY (idDiseñador) REFERENCES Persona(idPersona)
);

CREATE TABLE EdicionLibro(
   idLibro INT NOT NULL,
   codCaratula INT NOT NULL,
   fechaPublicacion DATETIME NOT NULL,
   precioVenta INT NOT NULL,
   cantEjemplares INT NOT NULL,
   PRIMARY KEY(idLibro, codCaratula),
   FOREIGN KEY (idLibro) REFERENCES Libro(idLibro),
   FOREIGN KEY (codCaratula) REFERENCES Caratula(codCaratula)
);

 * mysql://root:***@localhost:3306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [5]:
%%sql
-- Inserting data into Persona
INSERT INTO Persona(idPersona, nombre) VALUES
(1, 'John Doe'),
(2, 'Jane Doe'),
(3, 'Alice Smith'),
(4, 'Bob Johnson'),
(5, 'Charlie Brown'),
(6, 'David Davis'),
(7, 'Eve Evans'),
(8, 'Frank Franklin'),
(9, 'Grace Green'),
(10, 'Hank Hill'),
(11, 'Irene Iron'),
(12, 'Jack Jackson'),
(13, 'Kathy King'),
(14, 'Larry Light'),
(15, 'Molly Moon'),
(16, 'Nancy Nigh'),
(17, 'Oscar Orange'),
(18, 'Patty Pink'),
(19, 'Quincy Queen'),
(20, 'Randy Rainbow');

 * mysql://root:***@localhost:3306
20 rows affected.

[]

In [6]:
%%sql
-- Inserting data into Genero
INSERT INTO Genero(codGen, nombreGen, descripcion) VALUES
(1, 'Fiction', 'Fictional genre'),
(2, 'Non-Fiction', 'Non-Fictional genre'),
(3, 'Sci-Fi', 'Science Fiction genre'),
(4, 'Fantasy', 'Fantasy genre'),
(5, 'Mystery', 'Mystery genre'),
(6, 'Thriller', 'Thriller genre'),
(7, 'Biography', 'Biography genre'),
(8, 'History', 'Historical genre'),
(9, 'Romance', 'Romantic genre'),
(10, 'Horror', 'Horror genre'),
(11, 'Comedy', 'Comedy genre'),
(12, 'Drama', 'Dramatic genre'),
(13, 'Adventure', 'Adventure genre'),
(14, 'Action', 'Action genre'),
(15, 'Poetry', 'Poetic genre'),
(16, 'Philosophy', 'Philosophical genre'),
(17, 'Education', 'Educational genre'),
(18, 'Children', 'Children''s genre'),
(19, 'Young Adult', 'Young Adult genre'),
(20, 'Adult', 'Adult genre');

 * mysql://root:***@localhost:3306
20 rows affected.

[]

In [7]:
%%sql
-- Inserting data into Libro
INSERT INTO Libro(idLibro, titulo, idAutor) VALUES
(1, 'Book Title 1', 1),
(2, 'Book Title 2', 2),
(3, 'Book Title 3', 3),
(4, 'Book Title 4', 2),
(5, 'Book Title 5', 5),
(6, 'Book Title 6', 6),
(7, 'Book Title 7', 8),
(8, 'Book Title 8', 2),
(9, 'Book Title 9', 9),
(10, 'Book Title 10', 10),
(11, 'Book Title 11', 11),
(12, 'Book Title 12', 1),
(13, 'Book Title 13', 13),
(14, 'Book Title 14', 14),
(15, 'Book Title 15', 1),
(16, 'Book Title 16', 16),
(17, 'Book Title 17', 17),
(18, 'Book Title 18', 18),
(19, 'Book Title 19', 19),
(20, 'Book Title 20', 20),
(21, 'Book Title 21', 20),
(22, 'Book Title 22', 20);

 * mysql://root:***@localhost:3306
22 rows affected.

[]

In [8]:
%%sql
-- Inserting data into LibroGenero
INSERT INTO LibroGenero(idLibro, codGen) VALUES
(1, 5),
(2, 3),
(3, 5),
(4, 1),
(5, 9),
(1, 2),
(7, 6),
(8, 4),
(9, 10),
(12, 9),
(11, 5),
(12, 3),
(13, 7),
(14, 1),
(14, 9),
(14, 2),
(17, 2),
(18, 4),
(19, 10),
(20, 10),
(21, 10),
(22, 10);

 * mysql://root:***@localhost:3306
22 rows affected.

[]

In [9]:
%%sql
-- Inserting data into Caratula
INSERT INTO Caratula(codCaratula, idDiseñador, tipoDiseño) VALUES
(1, 5, 'Design Type 1'),
(2, 3, 'Design Type 2'),
(3, 3, 'Design Type 3'),
(4, 1, 'Design Type 4'),
(5, 9, 'Design Type 5'),
(6, 2, 'Design Type 6'),
(7, 6, 'Design Type 7'),
(8, 4, 'Design Type 8'),
(9, 10, 'Design Type 9'),
(10, 8, 'Design Type 10'),
(11, 5, 'Design Type 11'),
(12, 3, 'Design Type 12'),
(13, 7, 'Design Type 13'),
(14, 1, 'Design Type 14'),
(15, 9, 'Design Type 15'),
(16, 2, 'Design Type 16'),
(17, 6, 'Design Type 17'),
(18, 4, 'Design Type 18'),
(19, 10, 'Design Type 19'),
(20, 1, 'Design Type 20');

 * mysql://root:***@localhost:3306
20 rows affected.

[]

In [10]:
%%sql
-- Inserting data into EdicionLibro
INSERT INTO EdicionLibro(idLibro, codCaratula, fechaPublicacion, precioVenta, cantEjemplares) VALUES
(1, 1, '2022-01-01', 10, 100),
(2, 2, '2022-01-02', 20, 200),
(3, 3, '2022-01-03', 30, 300),
(4, 13, '2022-01-04', 40, 400),
(5, 5, '2022-01-05', 50, 500),
(6, 6, '2022-01-06', 60, 600),
(7, 7, '2022-01-07', 70, 700),
(8, 8, '2022-01-08', 80, 800),
(9, 9, '2022-01-09', 90, 900),
(10, 10, '2022-01-10', 100, 1000),
(11, 11, '2022-01-11', 110, 1100),
(12, 12, '2022-01-12', 120, 1200),
(13, 12, '2022-01-13', 130, 1300),
(14, 14, '2022-01-14', 140, 1400),
(15, 15, '2022-01-15', 150, 1500),
(16, 16, '2022-01-16', 160, 1600),
(17, 17, '2022-01-17', 170, 1700),
(18, 18, '2022-01-18', 180, 1800),
(19, 20, '2022-01-19', 190, 1900),
(20, 20, '2022-01-20', 200, 2000);

 * mysql://root:***@localhost:3306
20 rows affected.

[]

### Ahora, analicemos las demandas que se quieren satisfacer utilizando el lenguaje SQL:

a) Obtenga una lista con los nombres de los libros que pertenezcan a más de un género.

In [11]:
%%sql

-- via 1

SELECT l.titulo, COUNT(*) AS 'Cantidad de Generos'
FROM Libro as l
    INNER JOIN LibroGenero as lg
        ON l.idLibro = lg.idLibro
GROUP BY l.idLibro
HAVING COUNT(*) > 1;

 * mysql://root:***@localhost:3306
3 rows affected.

[('Book Title 1', 2), ('Book Title 12', 2), ('Book Title 14', 3)]

In [12]:
%%sql

-- via 2

SELECT l.titulo, COUNT(lg.codGen) AS 'Cantidad de Generos'
FROM Libro as l
    INNER JOIN LibroGenero as lg
        ON l.idLibro = lg.idLibro
GROUP BY l.idLibro
HAVING COUNT(lg.codGen) > 1;

 * mysql://root:***@localhost:3306
3 rows affected.

[('Book Title 1', 2), ('Book Title 12', 2), ('Book Title 14', 3)]

No muy complejo, cierto? Simplemente agrupamos por el libro y contamos el número de géneros que se le asocian, para filtar finalmente por aquellos con más de uno.

Ojo: Si bien en este caso en particular ambos acercamientos fucnionan, note la diferencia entre estas 2 vías. La función Count(*) retorna el número de filas, incluso aquellas con valores null. Como alternativa se puede especificar explícitamente el nombre de una columna dentro del count, de forma que se cuenten todas las filas pero se excluyan aquellas que contengan NULL en la columna especificada.

b) Obtenga un lista de los diseñadores que hayan creado la carátula de las ediciones que se han presentado a mayor precio. Limite esta lista a 5 diseñadores diferentes.

Una primera idea podría ser:

In [13]:
%%sql

SELECT DISTINCT idPersona, nombre, el.idLibro, el.codCaratula, precioVenta
FROM ((EdicionLibro as el
        INNER JOIN Caratula as c
          ON el.codCaratula = c.codCaratula)
        INNER JOIN Persona as p
          ON c.idDiseñador = p.idPersona)
ORDER BY precioVenta DESC
LIMIT 5;

 * mysql://root:***@localhost:3306
5 rows affected.

[(1, 'John Doe', 20, 20, 200),
 (1, 'John Doe', 19, 20, 190),
 (4, 'Bob Johnson', 18, 18, 180),
 (6, 'David Davis', 17, 17, 170),
 (2, 'Jane Doe', 16, 16, 160)]

Peeero...

Nótese que la propuesta anterior repite diseñadores, por lo tanto, no es la ideal. El distinct aplica a la tupla completa, no al nombre solamente como pudiera parecer. En la query interna se obtienen las ediciones de mayor precio, pero estas no poseen necesariamente diseñadores diferentes. Luego, en el caso de John Doe, el diseñador a cargo de las dos ediciones de mayor precio, su nombre se devuelve dos veces.

Otra idea pudiera ser, busquemos por cada diseñador las carátulas de mayor precio que ha obtenido y devolvamos los 5 primeros.

In [14]:
%%sql

SELECT idDiseñador, nombre, Max(precioVenta)
FROM ((EdicionLibro as el
        INNER JOIN Caratula as c
          ON el.codCaratula = c.codCaratula)
        INNER JOIN Persona as p
          ON c.idDiseñador = p.idPersona)
GROUP BY idDiseñador
ORDER BY Max(precioVenta) DESC
LIMIT 5;

 * mysql://root:***@localhost:3306
5 rows affected.

[(1, 'John Doe', 200),
 (4, 'Bob Johnson', 180),
 (6, 'David Davis', 170),
 (2, 'Jane Doe', 160),
 (9, 'Grace Green', 150)]

Y ahora qué sucede? Todo bien, todo correcto?...

Pues no tanto...

: (

Note ahora que, en el caso que existieran tan sólo 5 diseñadores en la base de datos, el resultado de esta consulta podría retornar el diseñador con el precio de edición más bajo.

Fijemos entonces un threshold que nos permita filtrar las ediciones que se han presentado a mayor precio, digamos que son aquellas cuyo precio sea mayor e igual que el promedio. Siguiendo esta idea, nuestra query final podría ser algo como:

In [15]:
%%sql

SELECT idPersona, nombre
FROM Persona
WHERE idPersona in
(SELECT idDiseñador 
     FROM EdicionLibro as el
        INNER JOIN Caratula as c
          ON el.codCaratula = c.codCaratula
WHERE precioVenta >= (SELECT avg(precioVenta) FROM EdicionLibro))
LIMIT 5;

 * mysql://root:***@localhost:3306
5 rows affected.

[(5, 'Charlie Brown'),
 (3, 'Alice Smith'),
 (1, 'John Doe'),
 (9, 'Grace Green'),
 (2, 'Jane Doe')]

c) Obtenga una lista de los libros cuyo autor es uno de los 3 autores que más libros ha
escrito.

La siguiente podría ser una propuesta bastante acertada, pero nótese que existen limitaciones sobre las funciones que una subquery puede incluir.

In [16]:
%%sql

SELECT l.idLibro, l.titulo, l.idAutor
FROM Libro as l
WHERE idAutor in
    (SELECT idAutor, Count(idLibro) 
     FROM Libro
     GROUP BY idAutor
     ORDER BY Count(idLibro) DESC
     LIMIT 3)

 * mysql://root:***@localhost:3306
(MySQLdb.NotSupportedError) (1235, "This version of MySQL doesn't yet support 'LIMIT & IN/ALL/ANY/SOME subquery'")
[SQL: SELECT l.idLibro, l.titulo, l.idAutor
FROM Libro as l
WHERE idAutor in
    (SELECT idAutor, Count(idLibro)
     FROM Libro
     GROUP BY idAutor
     ORDER BY Count(idLibro) DESC
     LIMIT 3)]
(Background on this error at: https://sqlalche.me/e/20/tw8g)

Luego, una alternativa sería, por ejemplo, efectuar un join en su lugar:

In [17]:
%%sql

SELECT l.idLibro, l.titulo, l.idAutor
FROM Libro as l
inner join
    (SELECT idAutor, Count(idLibro) 
     FROM Libro
     GROUP BY idAutor
     ORDER BY Count(idLibro) DESC
     LIMIT 3) as sublibro
    on l.idAutor = sublibro.idAutor

 * mysql://root:***@localhost:3306
9 rows affected.

[(1, 'Book Title 1', 1),
 (12, 'Book Title 12', 1),
 (15, 'Book Title 15', 1),
 (2, 'Book Title 2', 2),
 (4, 'Book Title 4', 2),
 (8, 'Book Title 8', 2),
 (20, 'Book Title 20', 20),
 (21, 'Book Title 21', 20),
 (22, 'Book Title 22', 20)]

Note el order by DESC, ya que por default es en orden ascendente.

d) Mantenga una tabla en la cual se pueda consultar la edición más económica para cada
libro, para ello:
    
i. Cree una tabla EdiciónMásEconómica(idLibro INT, idEdición INT)

ii. Cree un trigger llamado UpdateEdiciónMásEconómica que cada vez que se inserte una nueva EdiciónLibro actualice la edición más económica para el libro correspondiente.

In [18]:
%%sql

CREATE TABLE EdicionMasEconomica(
   idLibro INT NOT NULL Primary Key,
   idEdicion INT NOT NULL,
   FOREIGN KEY (idLibro) REFERENCES Libro(idLibro),
   FOREIGN KEY (idEdicion) REFERENCES Caratula(codCaratula)
);

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [19]:
%%sql

Select * from EdicionMasEconomica;

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [20]:
%%sql

CREATE TRIGGER UpdateEdicionMasEconomica
AFTER INSERT ON EdicionLibro
FOR EACH ROW
BEGIN
   DECLARE minPrice INT;
   DECLARE currentEdition INT;

   SELECT MIN(precioVenta) INTO minPrice FROM EdicionLibro WHERE idLibro = NEW.idLibro;

   SELECT codCaratula INTO currentEdition FROM EdicionLibro WHERE idLibro = NEW.idLibro AND precioVenta = minPrice;

   UPDATE EdicionMasEconomica SET idEdicion = currentEdition WHERE idLibro = NEW.idLibro;
END

 * mysql://root:***@localhost:3306
0 rows affected.

[]

Probemos...

In [21]:
%%sql

INSERT INTO EdicionLibro(idLibro, codCaratula, fechaPublicacion, precioVenta, cantEjemplares) VALUES
(20,2, '2022-01-01', 90, 100);

 * mysql://root:***@localhost:3306
1 rows affected.

[]

In [22]:
%%sql

Select * from EdicionMasEconomica;

 * mysql://root:***@localhost:3306
0 rows affected.

[]

Pero qué sucede? Si la edición que se añade es la primera de un libro en particular su valor no estaría en la tabla EdicionMasEconomica, por lo cual nuestro trigger no desencadenaría las acciones esperadas al no existir valores que modificar. Luego, una propuesta más acertada sería:

In [23]:
%%sql

DROP TRIGGER UpdateEdicionMasEconomica;

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [24]:
%%sql

CREATE TRIGGER UpdateEdicionMasEconomica
AFTER INSERT ON EdicionLibro
FOR EACH ROW
BEGIN
   DECLARE minPrice INT;
   DECLARE currentEdition INT;

   SELECT MIN(precioVenta) INTO minPrice FROM EdicionLibro WHERE idLibro = NEW.idLibro;

   SELECT codCaratula INTO currentEdition FROM EdicionLibro WHERE idLibro = NEW.idLibro AND precioVenta = minPrice;

   IF EXISTS (SELECT 1 FROM EdicionMasEconomica WHERE idLibro = NEW.idLibro) THEN
      UPDATE EdicionMasEconomica SET idEdicion = currentEdition WHERE idLibro = NEW.idLibro;
   ELSE
      INSERT INTO EdicionMasEconomica (idLibro, idEdicion) VALUES (NEW.idLibro, currentEdition);
   END IF;
END;

 * mysql://root:***@localhost:3306
0 rows affected.

[]

Insertemos una nueva edición:

In [25]:
%%sql

INSERT INTO EdicionLibro(idLibro, codCaratula, fechaPublicacion, precioVenta, cantEjemplares) VALUES
(22,2, '2022-01-01', 100, 100);

 * mysql://root:***@localhost:3306
1 rows affected.

[]

In [26]:
%%sql

Select * from EdicionMasEconomica;

 * mysql://root:***@localhost:3306
1 rows affected.

[(22, 2)]

Consideremos una edición de dicho libro con mejor precio:

In [27]:
%%sql

INSERT INTO EdicionLibro(idLibro, codCaratula, fechaPublicacion, precioVenta, cantEjemplares) VALUES
(22,1, '2023-01-01', 70, 100);

 * mysql://root:***@localhost:3306
1 rows affected.

[]

Veamos si la tabla fue modificada correctamente:

In [28]:
%%sql

Select * from EdicionMasEconomica;

 * mysql://root:***@localhost:3306
1 rows affected.

[(22, 1)]

Nota: Estas son sólo algunas propuestas de solución, recuerden que en SQL muchas veces existen diversas vías para obtener el mismo resultado esperado.